[
    {
        "题目": "当今世界正经历百年未有之大变局，新一轮（    ）深入发展。",
        "答案": "B"
    },
    {
        "题目": "总结党的百年奋斗重大成就和历史经验，是推进党的自我革命、提高全党（ ）和应对风险挑战能力、永葆党的生机活力的需要。",
        "答案": "B"
    },
    {
        "题目": "展望二〇三五年，我国将基本实现（    ），建成现代化经济体系。",
        "答案": "A"
    },
    {
        "题目": "《中共中央关于党的百年奋斗重大成就和历史经验的决议》用“（  ）个明确”对习近平新时代中国特色社会主义思想的核心内容作了进一步概括。",
        "答案": "A"
    },
    {
        "题目": "适应确保国计民生要求，以保障（    ）为底线，健全农业支持保护制度。",
        "答案": "A"
    },
    {
        "题目": "坚持（    ）原则，秉持绿色、开放、廉洁理念，深化务实合作，加强安全保障，促进共同发展。",
        "答案": "B"
    },
    {
        "题目": "以史为鉴、开创未来，必须坚持和发展中国特色社会主义。（  ），是党的全部理论和实践立足点，更是党百年奋斗得出的历史结论。",
        "答案": "A"
    },
    {
        "题目": "健全（     ）、公平统一、可持续的多层次社会保障体系。",
        "答案": "B"
    },
    {
        "题目": "我们实现了第一个百年奋斗目标，在中华大地上全面建成了小康社会，历史性地解决了绝对贫困问题，正在意气风发向着（ ）的第二个百年奋斗目标迈进。",
        "答案": "C"
    },
    {
        "题目": "各民主党派要紧扣参政党建设的目标和原则，不断提高（ ）、参政议政能力、组织领导能力、合作共事能力和解决自身问题能力。",
        "答案": "A"
    },
    {
        "题目": "党中央坚定不移推进全面从严治党，为全面建设社会主义现代化国家开好局、起好步提供了有力（   ）。",
        "答案": "B"
    },
    {
        "题目": "纪检监察机关要发挥监督专责机关作用，协助党委（  ），推动党内监督和其他各类监督贯通协同，探索深化贯通协同的有效路径。",
        "答案": "D"
    },
    {
        "题目": "习近平在庆祝中国共产党成立100周年大会上宣告，经过全党全国各族人民持续奋斗，我们实现了第一个一百年奋斗目标，在中华大地上全面建成了（）。",
        "答案": "C"
    },
    {
        "题目": "习近平在庆祝中国共产党成立100周年大会上提出，以史为鉴、开创未来，必须牢牢把握“（）”经验启示和根本要求。",
        "答案": "D"
    },
    {
        "题目": "2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，我们要落实中央对香港、澳门特别行政区（）。",
        "答案": "A"
    },
    {
        "题目": "习近平在庆祝中国共产党成立100周年大会上指出，中国共产党将继续同一切爱好和平的国家和人民一道，坚持互利共赢、不搞零和博弈，反对（）。",
        "答案": "C"
    },
    {
        "题目": "习近平在庆祝中国共产党成立100周年大会上指出，新的征程上，我们必须坚持党的全面领导，不断完善党的领导，增强“四个意识”、坚定“（）”。",
        "答案": "B"
    },
    {
        "题目": "马克思主义之所以行，就在于党不断推进马克思主义（）并用以指导实践。",
        "答案": "A"
    },
    {
        "题目": "马克思主义能不能在实践中发挥作用，关键在于能否把马克思主义基本原理同（）和时代特征结合起来。",
        "答案": "C"
    },
    {
        "题目": "继续推进马克思主义基本原理同中国具体实际相结合、同（）相结合，续写马克思主义中国化时代化新篇章。",
        "答案": "B"
    },
    {
        "题目": "（）是坚持和发展中国特色社会主义的必由之路。",
        "答案": "A"
    },
    {
        "题目": "（）是实现中华民族伟大复兴的必由之路。",
        "答案": "B"
    },
    {
        "题目": "（）是中国人民创造历史伟业的必由之路。",
        "答案": "C"
    },
    {
        "题目": "（）是新时代我国发展壮大的必由之路。",
        "答案": "D"
    },
    {
        "题目": "（）是党永葆生机活力、走好新的赶考之路的必由之路。",
        "答案": "D"
    },
    {
        "题目": "领导干部想问题、作决策，一定要对（）心中有数，多打大算盘、算大账，少打小算盘、算小账。",
        "答案": "B"
    },
    {
        "题目": "各级党员、干部特别是领导干部都要坚定党性立场，加强党性修养，心怀“国之大者”，遇到问题、作出决策、处理工作首先要从（）上想一想",
        "答案": "D"
    },
    {
        "题目": "要全面贯彻党的十九大和十九届历次全会精神，增强“四个意识”、坚定“四个自信”、做到“两个维护”，对“国之大者”领悟到位，始终在（）同党中央保持高度一致。",
        "答案": "D"
    },
    {
        "题目": "（），既是马克思主义政党的鲜明特征，也是我们党一以贯之的政治优势。",
        "答案": "B"
    },
    {
        "题目": "（）上的主动是最有利的主动，（）上的被动是最危险的被动。",
        "答案": "C"
    },
    {
        "题目": "增强政治判断力，就要以国家（）安全为大、以人民为重、以坚持和发展中国特色社会主义为本。",
        "答案": "D"
    },
    {
        "题目": "我国区域差异大、发展不平衡，现代化进程不可能齐步走，要鼓励（）率先实现现代化，支持带动其他地区实现现代化。",
        "答案": "A"
    },
    {
        "题目": "保证党的（）是党的生命，也是我们党能成为百年大党、创造世纪伟业的关键所在。",
        "答案": "C"
    },
    {
        "题目": "谋划“十四五”时期发展，要坚持发展为了（）、发展成果由人民共享，努力在推动高质量发展过程中办好各项民生事业、补齐民生领域短板。",
        "答案": "C"
    },
    {
        "题目": "（）是社会主义的本质要求，是人民群众的共同期盼。",
        "答案": "B"
    },
    {
        "题目": "党的十八大以来，我们把（）作为重中之重，使现行标准下农村贫困人口全部脱贫，就是促进全体人民共同富裕的一项重大举措。",
        "答案": "C"
    },
    {
        "题目": "在迎来中国共产党成立（）周年的重要时刻，我国脱贫攻坚战取得了全面胜利。",
        "答案": "D"
    },
    {
        "题目": "党的十八大以来，党中央鲜明提出，全面建成小康社会最艰巨最繁重的任务在（）特别是在贫困地区。",
        "答案": "C"
    },
    {
        "题目": "党的十八大以来，我们坚持实施扩大（）战略，使发展更多依靠（）特别是消费需求拉动。",
        "答案": "D"
    },
    {
        "题目": "（）是国内大循环的重要方面，也是确保国内国际两个循环比例关系健康的关键因素。",
        "答案": "A"
    },
    {
        "题目": "要牢牢守住（）这条底线。这是构建新发展格局的重要前提和保障，也是畅通国内大循环的题中应有之义。",
        "答案": "D"
    },
    {
        "题目": "要加快（）。这是畅通国民经济循环、增强国内大循环主体地位的重要基础。",
        "答案": "B"
    },
    {
        "题目": "要加快（）。这是确保国内大循环畅通、塑造我国在国际大循环中新优势的关键。",
        "答案": "A"
    },
    {
        "题目": "要推动（）。这是稳固国内大循环主体地位、增强在国际大循环中带动能力的迫切需要。",
        "答案": "B"
    },
    {
        "题目": "要提高（）。这是畅通国内大循环的出发点和落脚点，也是国内国际双循环相互促进的关键联结点。",
        "答案": "B"
    },
    {
        "题目": "（）年5月5日，在中国共产党直接关怀和领导下，中国共产主义青年团宣告成立。",
        "答案": "C"
    },
    {
        "题目": "在实现中华民族伟大复兴的征程上，中国共产党是先锋队，共青团是（），少先队是预备队。入队、入团、入党，是青年追求政治进步的“人生三部曲”。",
        "答案": "D"
    },
    {
        "题目": "下列哪种⾏为不属于违反中央⼋项规定精神的⾏为？",
        "答案": "D"
    },
    {
        "题目": "严禁在居民⼩区⽆营业执照的“⼀桌饭”、历史建筑、风景区内或“农家乐”等具有（  ）性质的隐蔽场所进⾏公务接待。",
        "答案": "B"
    },
    {
        "题目": "公司主要负责人到各部门调查研究时，陪同的部门负责人原则上不超过（）人。",
        "答案": "C"
    },
    {
        "题目": "八项规定要求厉行勤俭节约，严格遵守廉洁从政有关规定，其中不包括（）",
        "答案": "A"
    },
    {
        "题目": "八项规定要求，要改进调查研究，到基层调研时，不正确的做法是（）",
        "答案": "C"
    },
    {
        "题目": "如确需在重大节日前、节日后（）个工作日内，以及节日期间安排业务招待活动，招待发生部门应主动提前向综合部及纪委办公室备案。",
        "答案": "C"
    },
    {
        "题目": "内部业务招待活动，招待对象在10人以内的，陪同人数不得超过（）人 。",
        "答案": "C"
    },
    {
        "题目": "对外业务招待时，招待对象超过5人的，超过部分陪餐人数原则上不超过招待对象超过部分的（）。",
        "答案": "C"
    },
    {
        "题目": "内部业务招待活动，应本着内外有别、朴素节约的原则开展，不上酒、不得赠送纪念品，招待同一批次对象，原则上不超过（）次。",
        "答案": "B"
    },
    {
        "题目": "公司公务车辆申请（出杭州市），需经（）最后审批后，才流转至综合部派车管理员。",
        "答案": "C"
    },
    {
        "题目": "以下哪项，一般情况不可作为公务用车使用需求场景？",
        "答案": "C"
    },
    {
        "题目": "领导干部厉行节约、反对浪费工作情况，应当列为领导班子（）会和述职述廉的重要内容并接受评议。",
        "答案": "D"
    },
    {
        "题目": "部门领导出差可乘坐（）。",
        "答案": "B"
    },
    {
        "题目": "中国共产党要通过纠\"四风\"来不断改进干部队伍的工作作风；这\"四风\"是指：官僚主义、形式主义、（）、奢靡之风。",
        "答案": "C"
    },
    {
        "题目": "加强作风建设必须紧扣()这个关键。",
        "答案": "C"
    },
    {
        "题目": "作风建设永远在路上，永远没有体止符，必须（），持续努力、久久为功。",
        "答案": "C"
    },
    {
        "题目": "采访报道突发事件坚持导向正确、及时准确、（），全面客观报道事件动态及处置进程，推动事件的妥善处理，维护社会稳定和人心安定。",
        "答案": "B"
    },
    {
        "题目": "以下哪项不是共产党员在中央八项规定中的深刻体现？",
        "答案": "C"
    },
    {
        "题目": "习近平同志指出，党内脱离群众的现象大量存在，集中表现在（）这“四风”上。",
        "答案": "B"
    },
    {
        "题目": "中央八项规定要求，要改进警卫工作，坚持（）的原则，减少交通管制。",
        "答案": "A"
    },
    {
        "题目": "2012年12月4日中共中央政治局会议强调，制定改进工作作风、密切联系群众这方面的规定，指导思想就是（），体现从严治党。",
        "答案": "D"
    },
    {
        "题目": "加强和改进党的作风建设，努力实现领导干部作风的进一步转变，核心问题是要在领导干部中树立（）的良好风气，保持党同人民群众的血肉联系。",
        "答案": "B"
    },
    {
        "题目": "习近平总书记提出“三严三实”中的“三严”是指（）。",
        "答案": "B"
    }
]